# Ex 5.1: Part III (Outside Class)

In [1]:
import pandas as pd
import plotly.express as px

# 1. Read one of the data sources to combine into a Dataframe

In [2]:
df_categories = pd.read_excel("Data/w3schools_Data.xlsx", "Categories", skiprows=0)

print(df_categories.shape)
df_categories.head()

(8, 3)

,CategoryID,CategoryName,Description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"

# 2. Read a second data source to combine into a Dataframe

In [3]:
df_P2 = pd.read_csv("Data/P2_OrDet_Ord_Prod.csv")

print(df_P2.shape)
df_P2.head(3)

(518, 13)

,OrderDetailID,OrderID,Product_ID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID,Product_Name,SupplierID,CategoryID,ProductDescription,ProductPrice
0,1,10248,11,12,90,5,1996-07-04,3,Queso Cabrales,5,4,1 kg pkg.,21.0
1,2,10248,42,10,90,5,1996-07-04,3,Singaporean Hokkien Fried Mee,20,5,32 - 1 kg pkgs.,14.0
2,3,10248,72,5,90,5,1996-07-04,3,Mozzarella di Giovanni,14,4,24 - 200 g pkgs.,34.8

# 3. Make Crucial Decisions

### Decision 1: Choose the Left and Right Tables

In [4]:
left_table = df_P2
right_table = df_categories

### Decision 2:  Choose the Join Fields

In [5]:
left_table.head(1)

,OrderDetailID,OrderID,Product_ID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID,Product_Name,SupplierID,CategoryID,ProductDescription,ProductPrice
0,1,10248,11,12,90,5,1996-07-04,3,Queso Cabrales,5,4,1 kg pkg.,21.0

In [6]:
right_table.head(1)

   CategoryID CategoryName                                  Description
0           1    Beverages  Soft drinks, coffees, teas, beers, and ales

In [7]:
left_table_join_field = 'CategoryID'
right_table_join_field = 'CategoryID'

# 4. Use pandas *merge()* to create a Left Join

In [8]:
df_joined = pd.merge(left_table,       
                       right_table,     
                       left_on=left_table_join_field,
                       right_on=right_table_join_field,
                       how='left'         # Type of Join:  Left!
                      )

print()
print("Ex 5.1 Part 3: Merged Category data")
print("Left Table:  ", left_table.shape)
print("Right Table: ", right_table.shape)
print("Joined Dataframe: ", df_joined.shape)
print()

df_joined.head(2)

Ex 5.1 Part 3: Merged Category data
Left Table:   (518, 13)
Right Table:  (8, 3)
Joined Dataframe:  (518, 15)

,OrderDetailID,OrderID,Product_ID,Quantity,CustomerID,EmployeeID,OrderDate,ShipperID,Product_Name,SupplierID,CategoryID,ProductDescription,ProductPrice,CategoryName,Description
0,1,10248,11,12,90,5,1996-07-04,3,Queso Cabrales,5,4,1 kg pkg.,21.0,Dairy Products,Cheeses
1,2,10248,42,10,90,5,1996-07-04,3,Singaporean Hokkien Fried Mee,20,5,32 - 1 kg pkgs.,14.0,Grains/Cereals,"Breads, crackers, pasta, and cereal"

# Optional:  Save the Joined Dataframe as a CSV file

In [9]:
csv_file_to_create = "P3_OD_OR_Prod_Cat.csv"

filename_with_path = "Data/" + csv_file_to_create
df_joined.to_csv(filename_with_path, index=False)